#include <iostream>

int main() {
    int max, res, len;
    std::cin >> len;
    // Найти второй мансимум на всем отрезке, потом идти от него вправо и влево и ждать, пока второй максимум станет собой.
    for (int i = 0; i < len; ++i) {
        std::cout << "?" << i << " " << i;0
    }
}

